notes.org

*  CNNS
IBM’s Deep Blue supercomputer beat the chess world champion Garry Kasparov back in 1996

CNNs emerged from the study of the brain’s visual cortex, and they have been
used in image recognition since the 1980s. 

Due to the increase in computational power, the amount of available training
data, CNNs have managed to achieve superhuman performance on some complex visual tasks. 

They power image search services, self-driving cars, automatic video classification
systems, and voice recognition and natural language processing. 

* Convolutional Layers
The most important building block of a CNN is the convolutional layer.

Neurons in the first convolutional layer are not connected to every single
pixel in the input image, but only to pixels in their receptive fields. 

Each neuron in the second convolutional layer is connected only to
neurons located within a small rectangle in the first layer. 

This architecture allows the network to concentrate on small low-level features
in the first hidden layer. 

Then assemble them into larger higher-level features in the next hidden layer, and so on. 

In a CNN each layer is represented in 2D, which makes it easier to match neurons
with their corresponding inputs.

A neuron located in row i, column j of a given layer 
is connected to the outputs of the neurons in the previous layer located in 
| Position of a neuron | Connections in the previous layer |
| (i,j)                | (i:i+f_h-1,j:j+f_w-1)               |
where f_h and f_w are the height and width of the receptive field. 

** *Padding*
In order for a layer to have the same height and width as the previous layer, 
it is common to add zeros around the inputs. This is called zero padding.

** *Strides*
It is also possible to connect a large input layer to a much smaller layer by
spacing out the receptive fields, as shown in Figure 14-4. This
dramatically reduces the model’s computational complexity. The shift
from one receptive field to the next is called the stride. 

| Position of a neuron | Connections in the previous layer |
| (i,j)                | (i*s_h:i*s_h+f_h-1,j:j*s_w+f_w-1)      |
where s_h and s_w are the vertical and horizontal strides.

** Filters (Convolutional Kernel) 
A neuron's weights can be represented as a small image the size of the
receptive field, called *filters* or *convolution kernels*. 
Thus, a layer full of neurons using the same filter outputs a *feature map*, 
which highlights the areas in an image that activate the filter the most. 

You do not have to define the filters manually. 
During training the convolutional layer will automatically learn the most useful
filters for its task, and the layers above will learn to combine them into more
complex patterns.

In reality a convolutional layer has multiple filters and outputs 
*one feature map per filter*. 

It has one neuron per pixel in each feature map, 

All neurons within a given feature map share the same parameters. 

A neuron’s receptive field is the same as described earlier, but it extends
across all the previous layers’ feature maps. 

A convolutional layer simultaneously applies multiple trainable
filters to its inputs, making it capable of detecting multiple features anywhere
in its inputs.

The fact that all neurons in a feature map share the same parameters dramatically
reduces the number of parameters in the model. 

Once the CNN has learned to recognize a pattern in one location, it can
recognize it in any other location.

|------------------------+----------------------------------|
| layer l, feature map k | layer l-1                        |
|------------------------+----------------------------------|
| (i,j)                  | (ixs_h:ixs_h+f_h-1, jxs_w:jxs_w+f_w-1) |
|------------------------+----------------------------------|

* Memory Requirements
The reverse pass of backpropagation requires all the intermediate values
computed during the forward pass.
If training crashes because of an out-of-memory error, you can try reducing the
mini-batch size. 
Alternatively, you can try reducing dimensionality using a stride, 
or removing a few layers. 
Or you can try using 16-bit floats instead of 32-bit floats. 
Or you could distribute the CNN across multiple devices.

* Pooling Layers
Each neuron in a pooling layer is
connected to the outputs of a limited number of neurons in the previous
layer, located within a small rectangular receptive field. 
define its size, the stride, and the padding type, no weights; 

A max pooling layer also introduces some level of invariance
to small translations. 

By inserting a max pooling layer every few layers in a CNN, 
it is possible to get some level of translation invariance at a larger scale. 

Max pooling offers a small amount of rotational invariance and a
slight scale invariance. 

Such invariance can be useful in cases where the prediction should not depend on
these details, such as in classification tasks.

* TensorFlow Implementation
Strides default to the kernel size, 
#+begin_src  python
max_pool = keras.layers.MaxPool2D(pool_size=2)
#+end_src  

the depthwise max pooling layer 
average pooling layer, AvgPool2D 
max pooling preserves only the strongest features, 

max pooling offers stronger
translation invariance than average pooling, and it requires slightly less
compute.

Keras does not include a depthwise max pooling layer, but TensorFlow’s
low-level Deep Learning API does: 
#+begin_src  python
output = tf.nn.max_pool(
                        images,
                        ksize=(1, 1, 1, 3),
                        strides=(1, 1, 1, 3),
                        padding="valid"
)
#+end_src  python


You can include this as a layer in your Keras models

#+begin_src  python
depth_pool = keras.layers.Lambda(
                  lambda X: tf.nn.max_pool(
                                           X, 
                                           ksize=(1, 1, 1, 3), 
                                           strides=(1, 1, 1, 3),
                                           padding="valid"
))
#+end_src  python

Global average pooling layer. 

#+begin_src  python
global_avg_pool = keras.layers.GlobalAvgPool2D()
#+end_src  python
It’s equivalent to this simple Lambda layer, which computes the mean over
the spatial dimensions (height and width):

#+begin_src  python
global_avg_pool = keras.layers.Lambda(lambda X: tf.reduce_mean(X, axis= [1, 2]))
#+end_src  python

