notes.org
* Tensor Flow Implementation 
Input image: [height, width, channels]. 
A mini-batch: [mini-batch size, height, width, channels]. 
Weights of convolutional layer: [f_h, f_w, f_n′, f_n].
The bias terms of a convolutional layer:  1D tensor of shape [f_n].

#+begin_src python   :results output
from sklearn.datasets import load_sample_image
china = load_sample_image("china.jpg") / 255
flower = load_sample_image("flower.jpg") / 255
images = np.array([china, flower])
batch_size, height, width, channels = images.shape
filters = np.zeros(shape=(7, 7, channels, 2), dtype=np.float32)
filters[:, 3, :, 0] = 1 # vertical line
filters[3, :, :, 1] = 1 # horizontal line
outputs = tf.nn.conv2d(images, filters, strides=1, padding="same")
plt.imshow(outputs[0, :, :, 1], cmap="gray") # plot 1st image's 2nd
feature map
plt.show()
#+end_src 

Strides is equal to 1, 
Strides could could also be a 1D array with four elements, 
where the two central elements are the vertical and horizontal strides 
(s_h and s_w). 
The first and last elements must currently be equal to 1.

If set to "valid", the convolutional layer does not use zero padding and may
ignore some rows and columns at the bottom and right of the input image,
depending on the stride. This means that every neuron’s receptive field lies
strictly within valid positions inside the input, hence the name valid.

In a real CNN you would normally define filters as trainable variables so 
the neural net can learn which filters work best.

#+begin_src python 
conv = keras.layers.Conv2D(filters=32, 
                           kernel_size=3, 
                           strides=1,
                           padding="same", 
                           activation="relu")
#+end_src 
* CNN Architectures
Typical CNN architectures stack a 
few convolutional layers (each one generally followed by a ReLU layer), 
then a pooling layer, 
then another few convolutional layers (+ReLU), 
then another pooling layer, 
and so on.

The image gets smaller and smaller as it progresses through the network,
but it also typically gets deeper and deeper. 

At the top of the stack, a regular feedforward neural network is added, 
composed of a few fully connected layers (+ReLUs), 

and the final layer outputs the prediction.

A common mistake is to use convolution kernels that are too large. 
Smaller kernels use fewer parameters and require fewer computations, and it will
usually perform better. One exception is for the first convolutional layer

#+begin_src python 
model = keras.models.Sequential([
keras.layers.Conv2D(64, 7, activation="relu", padding="same", input_shape=[28, 28, 1]),
keras.layers.MaxPooling2D(2),
keras.layers.Conv2D(128, 3, activation="relu", padding="same"),
keras.layers.Conv2D(128, 3, activation="relu", padding="same"),
keras.layers.MaxPooling2D(2),
keras.layers.Conv2D(256, 3, activation="relu", padding="same"),
keras.layers.Conv2D(256, 3, activation="relu", padding="same"),
keras.layers.MaxPooling2D(2),
keras.layers.Flatten(),
keras.layers.Dense(128, activation="relu"),
keras.layers.Dropout(0.5),
keras.layers.Dense(64, activation="relu"),
keras.layers.Dropout(0.5),
keras.layers.Dense(10, activation="softmax")])
#+end_src

This CNN reaches over 92% accuracy on the test set. 
* LeNet-5
It was created by Yann LeCun in 1998 and has been widely used for handwritten
digit recognition (MNIST). 
* AlexNet
The AlexNet CNN architecture won the 2012 ImageNet ILSVRC challenge 
it achieved a top-five error rate of 17%, Alex Krizhevsky et al. 
it was the first to stack convolutional layers directly on top of one another,

To reduce over-fitting, the authors used two regularization techniques.

First, they applied dropout with a 50% 
AlexNet also uses a competitive normalization step immediately after the
ReLU step of layers C1 and C3, called *local response normalization*
(LRN): the most strongly activated neurons inhibit other neurons located
at the same position in neighboring feature maps. This encourages
different feature maps to specialize, pushing them apart and forcing them
to explore a wider range of features, ultimately improving generalization.
*  GoogLeNet 

Developed by Christian Szegedy et al. from Google Research. 
Won the ILSVRC 2014; the top-five error rate below 7%.
much deeper than previous CNNs 
Sub-networks called inception modules
which allow GoogLeNet to use parameters much more efficiently 
Inception module: 
"3 × 3 + 1(S)" means that the layer uses a 3 × 3 kernel, stride 1, 
and "same" padding. 

The input signal is first copied and fed to four different
layers. 

All convolutional layers use the ReLU activation function. 

Concatenate all the outputs along the depth dimension in the final depth
concatenation layer. 

- In fact, the layers serve three purposes:
  Although they cannot capture spatial patterns, 
  they can capture patterns along the depth dimension.
- They are configured to output fewer feature maps than their inputs, 
  so they serve as bottleneck layers, meaning they reduce dimensionality. 
- Each pair of convolutional layers acts like a single powerful convolutional
  layer, capable of capturing more complex patterns. simple linear classifier
  across the image, this pair of convolutional layers sweeps a two-layer neural
  network across the image.

The number of convolutional kernels for each convolutional layer is a
hyperparameter. 
Includes nine inception modules. 
The six numbers in the inception modules represent the
number of feature maps output by each convolutional layer in the module

The first two layers divide the image's height and width by 4 (so
its area is divided by 16)
Then the local response normalization layer ensures that the
previous layers learn a wide variety of features.

Two convolutional layers follow, where the first acts like a
bottleneck layer. 

Thanks to the dimensionality reduction brought by this layer, 
there is no need to have several fully connected layers at the top of the CNN
this considerably reduces the number of parameters in the network and limits the risk of overfitting. 
* VGGNet
It had a very simple and classical architecture, 
with 2 or 3 convolutional layers and a pooling layer, 
then again 2 or 3 convolutional layers and a pooling layer, 
and so on, 
plus a final dense network with 2 hidden layers and the output layer. 
It used only 3 × 3 filters, but many filters.
* ResNet
- Models are getting deeper and deeper 
- fewer and fewer parameters 
- use skip connections 
- The goal is to make it model a target function h(x) 
- If you add the input x to the output of the network, 
- Then the network will be forced to model f(x) = h(x) - x 
- If the target function is fairly close to the identity function, 
- This will speed up training considerably.
- If you add many skip connections, the network can start making
  Progress even if several layers have not started learning yet. 
- The signal can easily make its way across the whole network. 
- The deep residual network can be seen as a stack of residual units, 
- Where each residual unit is a small neural network with a skip connection.

Each residual unit is composed of two convolutional layers

number of feature maps is doubled every few residual units
their height and width are halved. 
When this happens, the inputs cannot be added directly to the outputs of the
residual unit because they don't have the same shape. 

We solve this problem, 
the inputs are passed through a 1 × 1 convolutional layer
with stride 2 and the right number of output feature maps.
