notes.tex
\section{Xception}
\label{sec:org7033066}
it merges the ideas of GoogLeNet and ResNet, 
but it replaces the inception modules with a special type of layer called a
depthwise separable convolution layer. 

These layers had been used before in some CNN architectures,
but they were not as central as in the Xception architecture. 

A separable convolutional layer makes the strong assumption that spatial
patterns and cross-channel patterns can be modeled separately. 

Thus, it is composed of two parts:
\begin{itemize}
\item A single spatial filter for each input feature map,
\item Then the second part looks exclusively for cross-channel patterns
\end{itemize}

Xception architecture starts with 2 regular convolutional layers, 
but then the rest of the architecture uses only separable convolutions,
plus a few max pooling layers and the usual final layers.

Separable convolutional layers use fewer parameters, less memory, and fewer
computations than regular convolutional layers, and in general they even perform
better, so you should consider using them by default.

\section{SENet}
\label{sec:orgb444a99}
The extended versions of inception
networks and ResNets are called SE-Inception and SE-ResNet,
respectively. 

The boost comes from the fact that a SENet adds a small
neural network, called an SE block, to every unit in the original
architecture, 

An SE block analyzes the output of the unit it is attached to, focusing
exclusively on the depth dimension (it does not look for any spatial
pattern), and it learns which features are usually most active together. It
then uses this information to recalibrate the feature maps, as shown in
Figure 14-21. For example, an SE block may learn that mouths, noses, and
eyes usually appear together in pictures: if you see a mouth and a nose,
you should expect to see eyes as well. So if the block sees a strong
activation in the mouth and nose feature maps, but only mild activation in
the eye feature map, it will boost the eye feature map (more accurately, it
will reduce irrelevant feature maps). If the eyes were somewhat confused
with something else, this feature map recalibration will help resolve the
ambiguity.

An SE block is composed of just three layers: a global average pooling
layer, a hidden dense layer using the ReLU activation function, and a
dense output layer using the sigmoid activation function (see Figure 14-
\begin{enumerate}
\item 
\end{enumerate}

As earlier, the global average pooling layer computes the mean activation
for each feature map: for example, if its input contains 256 feature maps,
it will output 256 numbers representing the overall level of response for
each filter. The next layer is where the “squeeze” happens: this layer has
significantly fewer than 256 neurons—typically 16 times fewer than the
number of feature maps (e.g., 16 neurons)—so the 256 numbers get
compressed into a small vector (e.g., 16 dimensions). This is a low-
dimensional vector representation (i.e., an embedding) of the distribution
of feature responses. This bottleneck step forces the SE block to learn a
general representation of the feature combinations (we will see this
principle in action again when we discuss autoencoders in Chapter 17).
Finally, the output layer takes the embedding and outputs a recalibration
vector containing one number per feature map (e.g., 256), each between 0
and 1. The feature maps are then multiplied by this recalibration vector, so
irrelevant features (with a low recalibration score) get scaled down while
relevant features (with a recalibration score close to 1) are left alone.
\end{document}
